docs/LAB02-domain.md
```mermaid
classDiagram

class Person {
  <<MappedSuperclass>>
  String id
  String fullName
  String email
  String phone
}

class Owner {
  int age
  boolean isActive
  boolean isBusiness
  String idLegalOwner
  LocalDate registrationDate
}

class Reviewer {
  int reputationScore
}

Person <|-- Owner
Person <|-- Reviewer

class ResidentialProperty {
  <<Entity + JOINED>>
  String id
  Long price
  Integer area
  Integer bedrooms
}

class Apartment {
  Integer bathrooms
  Integer stories
  String furnishingstatus
}

class House {
  int garageQty
  String roofType
  String garden
}

class Duplex {
  String balcony
  boolean elevator
}

ResidentialProperty <|-- Apartment
ResidentialProperty <|-- House
ResidentialProperty <|-- Duplex

class PropertyContract {
  String id
  LocalDate startDate
  LocalDate endDate
  String contractType
}

Owner "1" --> "0..*" PropertyContract
ResidentialProperty "1" --> "0..*" PropertyContract

class Review {
  String id
  String title
  String content
  int rating
  LocalDate reviewDate
}

Reviewer "1" --> "0..*" Review
ResidentialProperty "1" --> "0..*" Review

class School {
  String id
  String name
  String type
  String location
  int rating
  boolean isPublic
}

Apartment "0..*" --> "0..*" School
```
